ext_alsav/Documents/РасходныйОрдерНаТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РасходныйОрдерНаТовары</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаданиеНаПеревозку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРасходныхОрдеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТоварыПоРаспоряжениям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Распоряжение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаОтгрузку</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтгружаемыеТовары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УпаковочныйЛистРодитель</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ext_alsav/InformationRegisters/алсав_СоставИзделий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>алсав_СоставИзделий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВУзле</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПутьВСборкеНоменклатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПолуфабрикат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПродуктНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПродуктХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоМатериалы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоУзел</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантКомплектацииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектацииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПутьВСборке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/Enums/СтатусыРасходныхОрдеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыРасходныхОрдеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтбору</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ext_alsav/Enums/ДействияСоСтрокамиОрдеровНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДействияСоСтрокамиОрдеровНаОтгрузку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отгрузить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ext_alsav/Documents/РасходныйОрдерНаТовары/Ext/ManagerModule.bsl
&Вместо("ПараметрыУказанияСерий")
Функция алсав_ПараметрыУказанияСерий(Объект)
	// Вставить содержимое метода.
	ПараметрыУказанияСерий = ПродолжитьВызов(Объект);     
	Если Объект.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтбору Тогда
		ОтгружаемыеТовары = ПараметрыУказанияСерий.ОтгружаемыеТовары;
		
		ОтгружаемыеТовары.ПодготовкаОрдера = Истина;
		
	КонецЕсли;
	Возврат ПараметрыУказанияСерий;
КонецФункции

&Вместо("ТекстЗапросаТаблицаТоварыКОтгрузке")
Функция алсав_ТекстЗапросаТаблицаТоварыКОтгрузке(Запрос, ТекстыЗапроса, Регистры)
	// Вставить содержимое метода.
	//Результат = ПродолжитьВызов(Запрос, ТекстыЗапроса, Регистры);
	//Возврат Результат;
	
	ИмяРегистра = "ТоварыКОтгрузке";
	
	Если Не ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Склад КАК Склад,
	|	&ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку,
	|	&Получатель КАК Получатель,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтатусУказанияСерий В (10, 14)
	|			ТОГДА ТаблицаТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяССылка)
	|	КОНЕЦ КАК Серия,
	|	ТаблицаТовары.Распоряжение КАК ДокументОтгрузки,
	|	ТаблицаТовары.Количество КАК КОтгрузке,
	|	0 КАК КСборке,
	|	0 КАК Собирается,
	|	0 КАК Собрано,
	|   ТаблицаТовары.Назначение КАК Назначение
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК ТаблицаТовары
	|ГДЕ
	//
	|	(
	//
	|	&Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Отгружен)
	//
	|		ИЛИ &Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтбору)
	|	)
	//
	|	И ТаблицаТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	&Период,
	|	&Склад,
	|	&ЗаданиеНаПеревозку,
	|	&Получатель,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтатусУказанияСерий В (10, 14)
	|			ТОГДА ТаблицаТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяССылка)
	|	КОНЕЦ,
	|	ТаблицаТовары.Распоряжение,
	|	0,
	|	ТаблицаТовары.Количество,
	|	0,
	|	0,
	|   ТаблицаТовары.Назначение КАК Назначение								    
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК ТаблицаТовары
	|ГДЕ
	|	&Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Подготовлено)
	|	И ТаблицаТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	&Период,
	|	&Склад,
	|	&ЗаданиеНаПеревозку,
	|	&Получатель,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтатусУказанияСерий В (10, 14)
	|			ТОГДА ТаблицаТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяССылка)
	|	КОНЕЦ,
	|	ТаблицаТовары.Распоряжение,
	|	0,
	|	0,
	|	ТаблицаТовары.Количество,
	|	0,
	|   ТаблицаТовары.Назначение КАК Назначение								    
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК ТаблицаТовары
	|ГДЕ
	|	&Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КПроверке)
	|	И ТаблицаТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	&Период,
	|	&Склад,
	|	&ЗаданиеНаПеревозку,
	|	&Получатель,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтатусУказанияСерий В (10, 14)
	|			ТОГДА ТаблицаТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяССылка)
	|	КОНЕЦ,
	|	ТаблицаТовары.Распоряжение,
	|	0,
	|	0,
	|	0,
	|	ТаблицаТовары.Количество,
	|   ТаблицаТовары.Назначение КАК Назначение								   
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК ТаблицаТовары    
	
	|ГДЕ
	|	(&Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтгрузке)
	|		ИЛИ &Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Проверен))
	|	И ТаблицаТовары.Ссылка = &Ссылка";
	
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	&Период,
	|	&Склад,
	|	&ЗаданиеНаПеревозку,
	|	&Получатель,
	|	ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Номенклатура, ТаблицаТовары.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Характеристика, ТаблицаТовары.Характеристика) КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтатусУказанияСерий В (10, 14)
	|			ТОГДА ТаблицаТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяССылка)
	|	КОНЕЦ,
	|	ТаблицаТовары.Распоряжение,
	|	0,
	|	0,
	|	ТаблицаТовары.Количество * ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Количество, 1) Собирается,
	|	0,
	|   ТаблицаТовары.Назначение КАК Назначение								    
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК ТаблицаТовары
	
	//|	ЛЕВОЕ СОЕДИНЕНИЕ (
	//|		ВЫБРАТЬ
	//|			ВариантыКомплектацииНоменклатуры.Ссылка КАК Ссылка,
	//|			ВариантыКомплектацииНоменклатуры.Ссылка.Владелец КАК НоменклатураОсновногоКомпонента,
	//|			ВариантыКомплектацииНоменклатуры.Ссылка.Характеристика КАК ХарактеристикаОсновногоКомпонента,
	//|			ЕСТЬNULL(Полуфабрикаты.Номенклатура, ВариантыКомплектацииНоменклатуры.Номенклатура) КАК Номенклатура,
	//|			ЕСТЬNULL(Полуфабрикаты.Характеристика, ВариантыКомплектацииНоменклатуры.Характеристика) КАК Характеристика,
	//|			ЕСТЬNULL(Полуфабрикаты.Количество, 1) * ВариантыКомплектацииНоменклатуры.Количество КАК Количество,
	//|			ВариантыКомплектацииНоменклатуры.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат
	//|		ИЗ
	//|			Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатуры
	//|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК Полуфабрикаты
	//|				ПО (ВариантыКомплектацииНоменклатуры.ЭтоПолуфабрикат = ИСТИНА)
	//|					И ВариантыКомплектацииНоменклатуры.ВариантКомлектации = Полуфабрикаты.Ссылка
	//|					И Полуфабрикаты.Ссылка.ПометкаУдаления = ЛОЖЬ
	//|					И Полуфабрикаты.Ссылка.Основной
	//|			ГДЕ ВариантыКомплектацииНоменклатуры.Ссылка.ПометкаУдаления = ЛОЖЬ И ВариантыКомплектацииНоменклатуры.Ссылка.Основной
	//|	) КАК ВТ_ВариантыКомплектацииНоменклатуры           
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ( ВЫБРАТЬ 
	|			состав.ВариантКомплектацииНоменклатуры КАК Ссылка,
	|			состав.ПродуктНоменклатура КАК НоменклатураОсновногоКомпонента,
	|			состав.ПродуктХарактеристика КАК ХарактеристикаОсновногоКомпонента,
	|			состав.ПутьВСборке КАК НоменклатураПутьСборки,
	|			состав.Номенклатура КАК Номенклатура,
	|			состав.Характеристика КАК Характеристика,
	|			состав.Количество КАК Количество,
	|			состав.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат			
	|		ИЗ 
	|			РегистрСведений.алсав_СоставИзделий КАК состав  
	|		ГДЕ
	|			состав.ЭтоПолуфабрикат = ЛОЖЬ
	|			И состав.ЭтоМатериалы = ЛОЖЬ
	|		)КАК ВТ_ВариантыКомплектацииНоменклатуры    

	
	|		ПО (ВТ_ВариантыКомплектацииНоменклатуры.НоменклатураОсновногоКомпонента = ТаблицаТовары.Номенклатура)
	|			И (ВТ_ВариантыКомплектацииНоменклатуры.Характеристика IS NULL OR ВТ_ВариантыКомплектацииНоменклатуры.ХарактеристикаОсновногоКомпонента = ТаблицаТовары.Характеристика)

	|ГДЕ
	|	(&Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтбору)) 
	|	И ТаблицаТовары.Распоряжение ССЫЛКА Документ.ЗаказКлиента
	|	И ТаблицаТовары.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

&Вместо("ТекстЗапросаТаблицаТоварыНаСкладах")
Функция алсав_ТекстЗапросаТаблицаТоварыНаСкладах(Запрос, ТекстыЗапроса, Регистры)
	// Вставить содержимое метода.
	//Результат = ПродолжитьВызов(Запрос, ТекстыЗапроса, Регистры);
	//Возврат Результат;
	
	ИмяРегистра = "ТоварыНаСкладах";
	
	Если Не ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Склад КАК Склад,
	|	&Помещение КАК Помещение,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Количество КАК ВНаличии,
	|	0 КАК КОтгрузке,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтатусУказанияСерий В (4, 6, 8, 10, 14)
	|			ТОГДА ТаблицаТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПУстаяСсылка)
	|	КОНЕЦ КАК Серия,
	|	ИСТИНА КАК КонтролироватьОстатки,
	|	ТаблицаТовары.Назначение КАК Назначение
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	//
	|	(
	//
	|	&Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Отгружен)
	|	И ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить)
	//
	|	)
	|	ИЛИ &Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтбору)
	//
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	&Период,
	|	&Склад,
	|	&Помещение,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	0,
	|	ТаблицаТовары.Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтатусУказанияСерий В (6, 8, 10, 14)
	|			ТОГДА ТаблицаТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ИСТИНА,
	|	ТаблицаТовары.Назначение
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	|	(&Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КПроверке)
	|			ИЛИ &Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Проверен)
	|			ИЛИ &Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтгрузке)
	//|			ИЛИ &Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтбору)
	|			ИЛИ &Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Подготовлено))
	|	И (ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиОрдеровНаОтгрузку.Отобрать)
	|	ИЛИ ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить))";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
КонецФункции

&Вместо("ТекстЗапросаТаблицаТоварыКОтбору")
Функция алсав_ТекстЗапросаТаблицаТоварыКОтбору(Запрос, ТекстыЗапроса, Регистры)
	// Вставить содержимое метода.
	//Результат = ПродолжитьВызов(Запрос, ТекстыЗапроса, Регистры);
	//Возврат Результат;
	
	ИмяРегистра = "ТоварыКОтбору";
	
	Если Не ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтатусУказанияСерий В (6, 8, 10, 14)
	|			ТОГДА ТаблицаТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяССылка)
	|	КОНЕЦ КАК Серия,
	|	&Ссылка КАК Распоряжение,
	|	0 КАК КОтбору,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Упаковка.ТипУпаковки, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.ТоварноеМесто)
	|			ТОГДА ТаблицаТовары.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаТовары.Количество
	|	КОНЕЦ КАК Отобрано,
	|	ТаблицаТовары.Назначение КАК Назначение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Упаковка.ТипУпаковки, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.ТоварноеМесто)
	|			ТОГДА ТаблицаТовары.Упаковка
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|	КОНЕЦ КАК ТоварноеМесто
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК ТаблицаТовары
	|ГДЕ
	|	&ИспользоватьАдресноеХранение
	|	И ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить)
	|	И ТаблицаТовары.Ссылка = &Ссылка
	|	И НЕ ТаблицаТовары.ЭтоУпаковочныйЛист
	////
	//|	И ТаблицаТовары.Распоряжение ССЫЛКА Документ.ЗаказКлиента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	&Период,
	//|	ТаблицаТовары.Номенклатура,
	//|	ТаблицаТовары.Характеристика,
	|	ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Номенклатура, ТаблицаТовары.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Характеристика, ТаблицаТовары.Характеристика) КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтатусУказанияСерий В (6, 8, 10, 14)
	|			ТОГДА ТаблицаТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяССылка)
	|	КОНЕЦ,
	|	&Ссылка,    
	//+++
	|	ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Количество, 1) *
	//---
	|	ТаблицаТовары.Количество,
	|	0,
	|	ТаблицаТовары.Назначение,
	|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары 
	
		
	//|	ЛЕВОЕ СОЕДИНЕНИЕ (
	//|		ВЫБРАТЬ
	//|			ВариантыКомплектацииНоменклатуры.Ссылка КАК Ссылка,
	//|			ВариантыКомплектацииНоменклатуры.Ссылка.Владелец КАК НоменклатураОсновногоКомпонента,
	//|			ВариантыКомплектацииНоменклатуры.Ссылка.Характеристика КАК ХарактеристикаОсновногоКомпонента,
	//|			ЕСТЬNULL(Полуфабрикаты.Номенклатура, ВариантыКомплектацииНоменклатуры.Номенклатура) КАК Номенклатура,
	//|			ЕСТЬNULL(Полуфабрикаты.Характеристика, ВариантыКомплектацииНоменклатуры.Характеристика) КАК Характеристика,
	//|			ЕСТЬNULL(Полуфабрикаты.Количество, 1) * ВариантыКомплектацииНоменклатуры.Количество КАК Количество,
	//|			ВариантыКомплектацииНоменклатуры.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат
	//|		ИЗ
	//|			Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатуры
	//|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК Полуфабрикаты
	//|				ПО (ВариантыКомплектацииНоменклатуры.ЭтоПолуфабрикат = ИСТИНА)
	//|					И ВариантыКомплектацииНоменклатуры.ВариантКомлектации = Полуфабрикаты.Ссылка
	//|					И Полуфабрикаты.Ссылка.ПометкаУдаления = ЛОЖЬ
	//|					И Полуфабрикаты.Ссылка.Основной
	//|			ГДЕ ВариантыКомплектацииНоменклатуры.Ссылка.ПометкаУдаления = ЛОЖЬ И ВариантыКомплектацииНоменклатуры.Ссылка.Основной
	//|	) КАК ВТ_ВариантыКомплектацииНоменклатуры
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ( ВЫБРАТЬ 
	|			состав.ВариантКомплектацииНоменклатуры КАК Ссылка,
	|			состав.ПродуктНоменклатура КАК НоменклатураОсновногоКомпонента,
	|			состав.ПродуктХарактеристика КАК ХарактеристикаОсновногоКомпонента,
	|			состав.ПутьВСборке КАК НоменклатураПутьСборки,
	|			состав.Номенклатура КАК Номенклатура,
	|			состав.Характеристика КАК Характеристика,
	|			состав.Количество КАК Количество,
	|			состав.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат			
	|		ИЗ 
	|			РегистрСведений.алсав_СоставИзделий КАК состав  
	|		ГДЕ
	|			состав.ЭтоПолуфабрикат = ЛОЖЬ
	|			И состав.ЭтоМатериалы = ЛОЖЬ
	|		)КАК ВТ_ВариантыКомплектацииНоменклатуры    
	
	
	|		ПО (ВТ_ВариантыКомплектацииНоменклатуры.НоменклатураОсновногоКомпонента = ТаблицаТовары.Номенклатура)
	|			И (ВТ_ВариантыКомплектацииНоменклатуры.Характеристика IS NULL OR ВТ_ВариантыКомплектацииНоменклатуры.ХарактеристикаОсновногоКомпонента = ТаблицаТовары.Характеристика)


	|ГДЕ
	|	&ИспользоватьАдресноеХранение
	|	И ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиОрдеровНаОтгрузку.Отобрать)
	|	И &Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Подготовлено)
	////
	//|	И ТаблицаТовары.Распоряжение ССЫЛКА Документ.ЗаказКлиента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	&Период,
	//|	ТаблицаТовары.Номенклатура,
	//|	ТаблицаТовары.Характеристика,
	|	ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Номенклатура, ТаблицаТовары.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Характеристика, ТаблицаТовары.Характеристика) КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтатусУказанияСерий В (6, 8, 10, 14)
	|			ТОГДА ТаблицаТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяССылка)
	|	КОНЕЦ,
	|	&Ссылка,
	|	0,                                                           
	//+++
	|	ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Количество, 1) *
	//---
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Упаковка.ТипУпаковки, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.ТоварноеМесто)
	|			ТОГДА - ТаблицаТовары.КоличествоУпаковок
	|		ИНАЧЕ - ТаблицаТовары.Количество
	|	КОНЕЦ КАК Количество,
	|	ТаблицаТовары.Назначение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Упаковка.ТипУпаковки, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.ТоварноеМесто)
	|			ТОГДА ТаблицаТовары.Упаковка
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|	КОНЕЦ
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК ТаблицаТовары
	
	
	//|	ЛЕВОЕ СОЕДИНЕНИЕ (
	//|		ВЫБРАТЬ
	//|			ВариантыКомплектацииНоменклатуры.Ссылка КАК Ссылка,
	//|			ВариантыКомплектацииНоменклатуры.Ссылка.Владелец КАК НоменклатураОсновногоКомпонента,
	//|			ВариантыКомплектацииНоменклатуры.Ссылка.Характеристика КАК ХарактеристикаОсновногоКомпонента,
	//|			ЕСТЬNULL(Полуфабрикаты.Номенклатура, ВариантыКомплектацииНоменклатуры.Номенклатура) КАК Номенклатура,
	//|			ЕСТЬNULL(Полуфабрикаты.Характеристика, ВариантыКомплектацииНоменклатуры.Характеристика) КАК Характеристика,
	//|			ЕСТЬNULL(Полуфабрикаты.Количество, 1) * ВариантыКомплектацииНоменклатуры.Количество КАК Количество,
	//|			ВариантыКомплектацииНоменклатуры.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат
	//|		ИЗ
	//|			Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатуры
	//|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК Полуфабрикаты
	//|				ПО (ВариантыКомплектацииНоменклатуры.ЭтоПолуфабрикат = ИСТИНА)
	//|					И ВариантыКомплектацииНоменклатуры.ВариантКомлектации = Полуфабрикаты.Ссылка
	//|					И Полуфабрикаты.Ссылка.ПометкаУдаления = ЛОЖЬ
	//|					И Полуфабрикаты.Ссылка.Основной
	//|			ГДЕ ВариантыКомплектацииНоменклатуры.Ссылка.ПометкаУдаления = ЛОЖЬ И ВариантыКомплектацииНоменклатуры.Ссылка.Основной
	//|	) КАК ВТ_ВариантыКомплектацииНоменклатуры
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ( ВЫБРАТЬ 
	|			состав.ВариантКомплектацииНоменклатуры КАК Ссылка,
	|			состав.ПродуктНоменклатура КАК НоменклатураОсновногоКомпонента,
	|			состав.ПродуктХарактеристика КАК ХарактеристикаОсновногоКомпонента,
	|			состав.ПутьВСборке КАК НоменклатураПутьСборки,
	|			состав.Номенклатура КАК Номенклатура,
	|			состав.Характеристика КАК Характеристика,
	|			состав.Количество КАК Количество,
	|			состав.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат			
	|		ИЗ 
	|			РегистрСведений.алсав_СоставИзделий КАК состав  
	|		ГДЕ
	|			состав.ЭтоПолуфабрикат = ЛОЖЬ
	|			И состав.ЭтоМатериалы = ЛОЖЬ
	|		)КАК ВТ_ВариантыКомплектацииНоменклатуры    
	
	
	|		ПО (ВТ_ВариантыКомплектацииНоменклатуры.НоменклатураОсновногоКомпонента = ТаблицаТовары.Номенклатура)
	|			И (ВТ_ВариантыКомплектацииНоменклатуры.Характеристика IS NULL OR ВТ_ВариантыКомплектацииНоменклатуры.ХарактеристикаОсновногоКомпонента = ТаблицаТовары.Характеристика)
	
	

	|ГДЕ
	|	&ИспользоватьАдресноеХранение
	|	И ТаблицаТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиОрдеровНаОтгрузку.НеОтгружать)
	|	И ТаблицаТовары.Ссылка = &Ссылка
	|	И НЕ ТаблицаТовары.ЭтоУпаковочныйЛист
	////
	//|	И ТаблицаТовары.Распоряжение ССЫЛКА Документ.ЗаказКлиента
	|	";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса

КонецФункции

//&Вместо("ИнициализироватьДанныеДокумента")
//Процедура алсав_ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры)
//	// Вставить содержимое метода.
//	//ПродолжитьВызов(ДокументСсылка, ДополнительныеСвойства, Регистры);
//	
//		// Создание запроса инициализации движений и заполенение его параметров.
//	Запрос = Новый Запрос;
//	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
//	
//	// Формирование текста запроса.
//	ТекстыЗапроса = Новый СписокЗначений;
//	
//	ТекстЗапросаТаблицаТоварыНаСкладах(Запрос, ТекстыЗапроса, Регистры);
//	ТекстЗапросаТаблицаТоварыКОтгрузке(Запрос, ТекстыЗапроса, Регистры);
//	
//	Если ЛОЖЬ тогда ДокументСсылка = Документы.РасходныйОрдерНаТовары.ПустаяСсылка(); КонецЕсли;
//	
//	этоДляСборки = Ложь;
//	Если ДокументСсылка.ТоварыПоРаспоряжениям.Количество()>0 Тогда
//		Если ТипЗнч(ДокументСсылка.ТоварыПоРаспоряжениям[0].Распоряжение) = Тип("ДокументСсылка.СборкаТоваров") Тогда
//			этоДляСборки = Истина;
//		КонецЕсли;
//	КонецЕсли;
//	Если этоДляСборки = ложь Тогда		
//		ТекстЗапросаТаблицаТоварыКОтбору(Запрос, ТекстыЗапроса, Регистры);
//	КонецЕсли;
//	
//	ТекстЗапросаТаблицаДвиженияСерийТоваров(Запрос, ТекстыЗапроса, Регистры);
//	ТекстЗапросаТаблицаТоварыВЯчейках(Запрос, ТекстыЗапроса, Регистры);
//	
//	// Исполнение запроса и выгрузка полученных таблиц для движений.
//	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
//КонецПроцедуры
